app/Validation/getEmail.php

SELECT *
FROM `company`
WHERE `emailCompany` = 'iky@gmail.com'
 LIMIT 1
---
    public function email_company(string $str, string $fields, array $data) {
        $companyModel = new \App\Models\CompanyModel();
        $getEmail = $companyModel->where('emailCompany', $data['email'])->first();