app/Views/LayoutHome/Navbar/NavbarViewPartial.php

SELECT *
FROM `user`
WHERE `idUser` = 'USER - 683c27f176e48'
 LIMIT 1
---
<?php
if (!isset($detailUser) && session()->get('idUser')) {
    $userModel = new \App\Models\UserModel();
    $detailUser = $userModel->where('idUser', session()->get('idUser'))->first();