app/Controllers/CompanyDashboard.php

    public function __construct()
    {
        $this->companyModel = new \App\Models\CompanyModel();
        $this->validation = \Config\Services::validation();
        $this->jobDeskModel = new \App\Models\JobDeskModel();
        $this->cvModel = new \App\Models\CVModel();
        $this->db = \Config\Database::connect();
        $this->data = [
            'title' => 'Dashboard Company',
            'companyDetail' => $this->companyModel->where('idCompany', session()->get('id_company'))->first()
---
SELECT *
FROM `company`
WHERE `idCompany` = 'COMPANY - 20250601194651.907440'
 LIMIT 1

    public function index()
    {
        $this->data['listJob'] = $this->jobDeskModel->where('idCompany', session()->get('id_company'))->findAll();
---
SELECT *
FROM `job_desk`
WHERE `idCompany` = 'COMPANY - 20250601194651.907440'
AND `job_desk`.`deleted_at` IS NULL