app/Controllers/Job.php

    public function index()
    {
        $keyword = $this->request->getGet('keyword');
        $data = [
            'title' => 'JobStreet - Cari Lowongan Kerja',
            'jobDesk' => $this->jobDeskModel->join('company','company.idCompany = job_desk.idCompany')->paginate(4,'job_desk'),
            'pager' => $this->jobDeskModel->pager,
            'detailUser' => $this->userModel->where('idUser', session()->get('idUser'))->first(),
---
SELECT *
FROM `job_desk`
JOIN `company` ON `company`.`idCompany` = `job_desk`.`idCompany`
WHERE `job_desk`.`deleted_at` IS NULL
 LIMIT 4
SELECT COUNT(*) AS `numrows`
FROM `job_desk`
JOIN `company` ON `company`.`idCompany` = `job_desk`.`idCompany`
WHERE `job_desk`.`deleted_at` IS NULL
SELECT *
FROM `user`
WHERE `idUser` = 'USER - 683c27f176e48'
 LIMIT 1

    public function detailJob() {
        $detailJob = $this->jobDeskModel->join('company','company.idCompany = job_desk.idCompany')
            ->where('idJob', $this->request->getPost('idJob'))->first();
---
SELECT *
FROM `job_desk`
JOIN `company` ON `company`.`idCompany` = `job_desk`.`idCompany`
WHERE `idJob` = 'JOB - 62e8c528406c5'
AND `job_desk`.`deleted_at` IS NULL
 LIMIT 1

    public function applyJob() {
        if (session()->get('idUser')) {
            $checkCV = $this->resumeModel->where('idUser', session()->get('idUser'))->first();
            if (empty($checkCV)) {
                return json_encode(array(
                    'idJob' => $this->request->getPost('idJob'),
                    'checkCV' => 'Silahkan Upload CV Anda Terlebih Dahulu',
                    'success' => 'WORK',
                    'csrf_token' => csrf_hash(),
                ));
            } else {
                $checkDuplicateApplyJob = $this->cvModel->where('idUser', session()->get('idUser'))
                    ->where('idJob', $this->request->getPost('idJob'))->first();
                if (empty($checkDuplicateApplyJob)) {
                    try {
                        $this->cvModel->insert([
                            'idCV' => 'CV - ' . uniqid(),
                            'idUser' => session()->get('idUser'),
                            'idJob' => $this->request->getPost('idJob'),
                            'idResume' => $checkCV['idResume']
                        ]);
---
SELECT *
FROM `resume`
WHERE `idUser` = 'USER - 686379d5c2e9b'
 LIMIT 1

    public function search()
    {
        $keyword = $this->request->getGet('keyword');
        $jobDeskModel = new \App\Models\JobDeskModel();

        // Query pencarian
        $jobDesk = $jobDeskModel
            ->join('company','company.idCompany = job_desk.idCompany')
            ->like('namaJob', $keyword)
            ->orLike('namaCompany', $keyword)
            ->orLike('alamat', $keyword)
            ->paginate(30, 'job_desk');
---
SELECT *
FROM `job_desk`
JOIN `company` ON `company`.`idCompany` = `job_desk`.`idCompany`
WHERE `namaJob` LIKE '%Developer%' ESCAPE '!'
OR  `namaCompany` LIKE '%Developer%' ESCAPE '!'
OR  `alamat` LIKE '%Developer%' ESCAPE '!'
AND `job_desk`.`deleted_at` IS NULL
 LIMIT 30
SELECT COUNT(*) AS `numrows`
FROM `job_desk`
JOIN `company` ON `company`.`idCompany` = `job_desk`.`idCompany`
WHERE `namaJob` LIKE '%Developer%' ESCAPE '!'
OR  `namaCompany` LIKE '%Developer%' ESCAPE '!'
OR  `alamat` LIKE '%Developer%' ESCAPE '!'
AND `job_desk`.`deleted_at` IS NULL