app/Controllers/Job.php

SELECT COUNT(*) AS `numrows`
FROM `job_desk`
WHERE `namaJob` LIKE '%Web Development%' ESCAPE '!'
AND `job_desk`.`deleted_at` IS NULL
SELECT COUNT(*) AS `numrows`
FROM `company`
---
    public function index()
    {
        $keyword = $this->request->getGet('keyword');

        // Hitung jumlah lowongan Web Development
        $webDevCount = $this->jobDeskModel
            ->like('namaJob', 'Web Development')
            ->countAllResults();

        // Hitung jumlah perusahaan
        $companyModel = new \App\Models\CompanyModel();
        $companyCount = $companyModel->countAllResults();

SELECT *
FROM `job_desk`
JOIN `company` ON `company`.`idCompany` = `job_desk`.`idCompany`
WHERE `namaJob` LIKE '%ob%' ESCAPE '!'
OR  `namaCompany` LIKE '%ob%' ESCAPE '!'
OR  `alamat` LIKE '%ob%' ESCAPE '!'
AND `job_desk`.`deleted_at` IS NULL
 LIMIT 30
SELECT COUNT(*) AS `numrows`
FROM `job_desk`
JOIN `company` ON `company`.`idCompany` = `job_desk`.`idCompany`
WHERE `namaJob` LIKE '%ob%' ESCAPE '!'
OR  `namaCompany` LIKE '%ob%' ESCAPE '!'
OR  `alamat` LIKE '%ob%' ESCAPE '!'
AND `job_desk`.`deleted_at` IS NULL
---
    public function search()
    {
        $keyword = $this->request->getGet('keyword');
        $jobDeskModel = new \App\Models\JobDeskModel();

        // Query pencarian: cari di namaJob, namaCompany, atau alamat
        $jobDesk = $jobDeskModel
            ->join('company', 'company.idCompany = job_desk.idCompany')
            ->like('namaJob', $keyword)
            ->orLike('namaCompany', $keyword)
            ->orLike('alamat', $keyword)
            ->paginate(30, 'job_desk');