app/Controllers/LoginCompany.php

    public function loginCompany() {
        $this->validation->setRules(
            [
                'email' => [
                    'label'  => 'Email',
                    'rules'  => 'required|valid_email|email_company[email]',
                    'errors' => [
                        'required' => 'Kolom Wajib Diisi',
                        'valid_email' => '{field} tidak valid',
                        'is_unique' => '{field} sudah terdaftar',
                        'email_company' => '{field} tidak ditemukan'
                    ],
                ],
                'password' => [
                    'label'  => 'Password',
                    'rules'  => 'required|string|min_length[8]|max_length[20]|check_password[email,password]|',
                    'errors' => [
                        'required' => 'Kolom Wajib Diisi',
                        'string' => 'Kolom tidak Valid',
                        'min_length' => 'Kolom minimal 8 character',
                        'max_length' => 'Maksimal minimal 20 character',
                        'check_password' => '{field} salah',
                    ],
                ],
            ]
        );
        if ($this->validation->withRequest($this->request)->run()) {
            $idCompany = $this->companyModel->where('emailCompany', $this->request->getPost('email'))->first()['idCompany'];
---
SELECT *
FROM `company`
WHERE `emailCompany` = 'iky@gmail.com'
 LIMIT 1