app/Controllers/UserDashboard.php

    public function user() {
        $data = [
            'title' => 'Dashboard Seeker | JobStreet.co.id',
            'profileUser' => $this->userModel->where('idUser', session()->get('idUser'))->first(),
            'detailUser' => $this->userModel->where('idUser', session()->get('idUser'))->first(),
---
SELECT *
FROM `user`
WHERE `idUser` = 'USER - 686379d5c2e9b'
 LIMIT 1

    public function resumeCV() {
        $data = [
            'title' => 'Dashboard Seeker | JobStreet.co.id',
            'dataCV' => $this->resumeModel->where('resume.idUser', session()->get('idUser'))
                ->join('user', 'user.idUser = resume.idUser')->first(),
            'detailUser' => $this->userModel->where('idUser', session()->get('idUser'))->first(),
---
SELECT *
FROM `resume`
JOIN `user` ON `user`.`idUser` = `resume`.`idUser`
WHERE `resume`.`idUser` = 'USER - 686379d5c2e9b'
 LIMIT 1
SELECT *
FROM `user`
WHERE `idUser` = 'USER - 686379d5c2e9b'
 LIMIT 1